conf/src/Documents/ЗапускТестирования/ЗапускТестирования.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ЗапускТестирования</name>
  <attributes>
    <name>Pipeline_ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Ветка</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВеткаСтрокой</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаЗавершения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапуститьТестыВыполненныеСОшибкой</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТестов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Настройка</name>
    <type>
      <types>CatalogRef.НастройкиЗапускаТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>СборкаВерсии</name>
    <type>
      <types>CatalogRef.СборкиВерсии</types>
    </type>
  </attributes>
  <attributes>
    <name>Тег</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РодительскийЗапуск</name>
    <type>
      <types>DocumentRef.ЗапускТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>Длительность</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Document>

conf/src/InformationRegisters/РезультатыВыполненияТестов/РезультатыВыполненияТестов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РезультатыВыполненияТестов</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Статус</name>
    <type>
      <types>EnumRef.СтатусыВыполненияТеста</types>
    </type>
  </resources>
  <attributes>
    <name>ЗапускТестирования</name>
    <type>
      <types>DocumentRef.ЗапускТестирования</types>
    </type>
  </attributes>
  <attributes>
    <name>НачалоВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>НомерЗаданияТестирования</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОкончаниеВыполнения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДочернийЗапускТестирования</name>
    <type>
      <types>DocumentRef.ЗапускТестирования</types>
    </type>
  </attributes>
  <dimensions>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Ветка</name>
    <type>
      <types>CatalogRef.Ветки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тест</name>
    <type>
      <types>CatalogRef.Тесты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭлементТеста</name>
    <type>
      <types>CatalogRef.ФормыОбъектовМетаданных</types>
      <types>CatalogRef.ОбъектыМетаданных</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

conf/src/Enums/СтатусыВыполненияТеста/СтатусыВыполненияТеста.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СтатусыВыполненияТеста</name>
  <enumValues>
    <name>ВыполненУспешно</name>
  </enumValues>
  <enumValues>
    <name>ВыполненСОшибкой</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>НеЗапускался</name>
  </enumValues>
</mdclass:Enum>

conf/src/Catalogs/НастройкиЗапускаСценариев/НастройкиЗапускаСценариев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиЗапускаСценариев</name>
  <owners>Catalog.ЭталонныеБазыТестирования</owners>
  <attributes>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.СценарииРаботыПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрофильПользователя</name>
    <type>
      <types>CatalogRef.ПрофилиПользователей</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрыЗапуска</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Публикуется</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПараметрыТеста</name>
    <attributes>
      <name>Имя</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>ФО</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>НесколькоЗначений</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ТипПараметра</name>
      <type>
        <types>EnumRef.ТипПараметраСценарияИлиПроцесса</types>
      </type>
    </attributes>
    <attributes>
      <name>ИсходящийПараметр</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДоТеста</name>
    <attributes>
      <name>Шаг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМакета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипШага</name>
      <type>
        <types>EnumRef.ТипШагаСценария</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПроверкаТеста</name>
    <attributes>
      <name>Шаг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМакета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипШага</name>
      <type>
        <types>EnumRef.ТипШагаСценария</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ПослеТеста</name>
    <attributes>
      <name>Шаг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Данные</name>
      <type>
        <types>ValueStorage</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяМакета</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипШага</name>
      <type>
        <types>EnumRef.ТипШагаСценария</types>
      </type>
    </attributes>
    <attributes>
      <name>АдресДанных</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

conf/src/Catalogs/Тесты/Тесты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Тесты</name>
  <hierarchical>true</hierarchical>
  <owners>Catalog.Проекты</owners>
  <attributes>
    <name>UIDНастройкиСценария</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>40</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяВСистемеСборки</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаЗапускаПроцесса</name>
    <type>
      <types>CatalogRef.НастройкиЗапускаПроцессов</types>
    </type>
  </attributes>
  <attributes>
    <name>НастройкаЗапускаСценария</name>
    <type>
      <types>CatalogRef.НастройкиЗапускаСценариев</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксГруппы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>РазделПроекта</name>
    <type>
      <types>CatalogRef.РазделыПроекта</types>
    </type>
  </attributes>
  <attributes>
    <name>РезультатыТестаДетализируютсяПоОбъектамМетаданных</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Универсальный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

conf/src/Documents/ЗапускТестирования/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Если Не ЭтоНовый() Тогда
		Возврат;
	КонецЕсли;	
	
	Автор = Пользователи.ТекущийПользователь();  
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("Структура") Тогда
		Если ДанныеЗаполнения.Свойство("Ветка") Тогда
			
			Ветка = ДанныеЗаполнения.Ветка;     
			
			ЗначенияРеквизитов = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(ДанныеЗаполнения.Ветка, "Владелец,НастройкаЗапускаТестирования");
			Проект = ЗначенияРеквизитов.Владелец;
			Настройка = ЗначенияРеквизитов.НастройкаЗапускаТестирования;
			
		ИначеЕсли ДанныеЗаполнения.Свойство("Настройка") Тогда
			
			Настройка = ДанныеЗаполнения.Настройка;
			Проект = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеЗаполнения.Настройка,"Владелец");
			
		КонецЕсли;	
	КонецЕсли;
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	Pipeline_ID = "";
	Автор = Пользователи.ТекущийПользователь();
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	ЗапускатьАвтоматическоеТестирование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект,"ЗапускатьАвтоматическоеТестирование");
	Если ДополнительныеСвойства.Свойство("НеЗапускатьАвтоматическоеТестирование") Тогда
		ЗапускатьАвтоматическоеТестирование = Ложь;
	КонецЕсли;
	
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение
		И ЗапускатьАвтоматическоеТестирование Тогда
		Если НЕ ЗначениеЗаполнено(Номер) Тогда
			УстановитьНовыйНомер();
		КонецЕсли;
		ИмяВетки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ветка, "Имя");
		Результат = ТестированиеЗапускТестирования.ЗапуститьТестирование(Проект, ИмяВетки, ПараметрыДляЗапускаТестирования());
		
		Если Результат.ЗапросВыполненУспешно Тогда
			Pipeline_ID = Результат.Ответ;
		Иначе
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Ответ, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	ЗапускатьАвтоматическоеТестирование = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Проект,"ЗапускатьАвтоматическоеТестирование");
	
	Если ЗапускатьАвтоматическоеТестирование
		И ЗначениеЗаполнено(Pipeline_ID) Тогда
		Результат = ТестированиеЗапускТестирования.ОтменитьТестирование(Проект, Pipeline_ID);
		Если НЕ Результат.ЗапросВыполненУспешно Тогда
			Отказ = Истина;
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(Результат.Ответ, ЭтотОбъект);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ПараметрыДляЗапускаТестирования()
	
	Параметры = Новый Соответствие;
	Параметры.Вставить("TRIGGER_ID", СокрЛП(Номер));
   
	Параметры.Вставить("branch_type", Строка(ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Ветка, "Тип")));
	Параметры.Вставить("run_failed_tests", Строка(ЗапуститьТестыВыполненныеСОшибкой));
	
	Если ЗапуститьТестыВыполненныеСОшибкой Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	РезультатыВыполненияТестовСрезПоследних.Тест КАК Ссылка,
		               |	РезультатыВыполненияТестовСрезПоследних.Проект.Наименование КАК Проект,
		               |	РезультатыВыполненияТестовСрезПоследних.Проект.ИдентификаторПрограммы КАК ИдентификаторПроекта,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.Код КАК Код,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.Наименование КАК Наименование,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.ИмяВСистемеСборки КАК ИмяВСистемеСборки,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.UIDНастройкиСценария КАК UIDНастройкиСценария,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаСценария.Код КАК НастройкаЗапускаСценарияКод,
		               |	РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаПроцесса.Код КАК НастройкаЗапускаПроцессаКод,
		               |	ВЫБОР
		               |		КОГДА РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаСценария <> ЗНАЧЕНИЕ(Справочник.НастройкиЗапускаСценариев.ПустаяСсылка)
		               |			ТОГДА РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаСценария.Владелец.ИдентификаторБазы
		               |		ИНАЧЕ РезультатыВыполненияТестовСрезПоследних.Тест.НастройкаЗапускаПроцесса.ЭталоннаяБаза.ИдентификаторБазы
		               |	КОНЕЦ КАК ИдентификаторБазы
		               |ИЗ
		               |	РегистрСведений.РезультатыВыполненияТестов.СрезПоследних(
		               |			,
		               |			Ветка = &Ветка
		               |				И ЭлементТеста = НЕОПРЕДЕЛЕНО) КАК РезультатыВыполненияТестовСрезПоследних
		               |ГДЕ
		               |	РезультатыВыполненияТестовСрезПоследних.Статус <> ЗНАЧЕНИЕ(Перечисление.СтатусыВыполненияТеста.ВыполненУспешно)";
		Запрос.УстановитьПараметр("Ветка", Ветка);
		ЗаполнитьПараметрыДляЗапускаПоТестам(Запрос.Выполнить().Выбрать(), Параметры, "failed");
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Настройка) Тогда
		Запрос = Новый Запрос;
		Запрос.Текст = "ВЫБРАТЬ
		               |	Тесты.Ссылка КАК Ссылка,
		               |	"""" КАК Проект,
		               |	"""" КАК ИдентификаторПроекта,
		               |	Тесты.Ссылка.Код КАК Код,
		               |	Тесты.Наименование КАК Наименование,
		               |	Тесты.ИмяВСистемеСборки КАК ИмяВСистемеСборки,
		               |	Тесты.UIDНастройкиСценария КАК UIDНастройкиСценария,
		               |	Тесты.НастройкаЗапускаСценария.Код КАК НастройкаЗапускаСценарияКод,
		               |	Тесты.НастройкаЗапускаПроцесса.Код КАК НастройкаЗапускаПроцессаКод,
		               |	ВЫБОР
		               |		КОГДА Тесты.НастройкаЗапускаСценария <> ЗНАЧЕНИЕ(Справочник.НастройкиЗапускаСценариев.ПустаяСсылка)
		               |			ТОГДА Тесты.НастройкаЗапускаСценария.Владелец.ИдентификаторБазы
		               |		ИНАЧЕ Тесты.НастройкаЗапускаПроцесса.ЭталоннаяБаза.ИдентификаторБазы
		               |	КОНЕЦ КАК ИдентификаторБазы
		               |ИЗ
		               |	Справочник.Тесты КАК Тесты
		               |ГДЕ
		               |	(Тесты.Родитель В (&Тесты)
		               |			ИЛИ Тесты.Ссылка В (&Тесты))";
		Запрос.УстановитьПараметр("Тесты", Настройка.Тесты.ВыгрузитьКолонку("Тест"));
		ЗаполнитьПараметрыДляЗапускаПоТестам(Запрос.Выполнить().Выбрать(), Параметры, "test");
		
		Для Каждого Строка Из Настройка.ПараметрыЗапуска Цикл
			НовоеЗначение = Строка.Значение;
			Если Параметры.Получить(Строка.Ключ) <> Неопределено Тогда
				НовоеЗначение = Параметры[Строка.Ключ] + " " + НовоеЗначение;
			КонецЕсли;
			Параметры.Вставить(Строка.Ключ, НовоеЗначение);
		КонецЦикла;
	КонецЕсли;

	Возврат Параметры;
	
КонецФункции
 
Процедура ЗаполнитьПараметрыДляЗапускаПоТестам(ВыборкаТестов, Параметры, ИмяПараметра="test")
	ЗаписьJSON = Новый ЗаписьJSON;
	ЕстьТесты = Ложь;
	
	Пока ВыборкаТестов.Следующий() Цикл
		ЕстьТесты = Истина;
			
		ЗаписьJSON.УстановитьСтроку();
		ЗаписьJSON.ЗаписатьНачалоОбъекта();
		ЗаписьJSON.ЗаписатьИмяСвойства("Тест");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.Наименование));   
		ЗаписьJSON.ЗаписатьИмяСвойства("Проект");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.Проект));
		ЗаписьJSON.ЗаписатьИмяСвойства("ИдентификаторПроекта");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.ИдентификаторПроекта));
		ЗаписьJSON.ЗаписатьИмяСвойства("ИмяВСистемеСборки");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.ИмяВСистемеСборки));
		ЗаписьJSON.ЗаписатьИмяСвойства("UIDНастройкиСценария");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.UIDНастройкиСценария));
		ЗаписьJSON.ЗаписатьИмяСвойства("НастройкаЗапускаСценария");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.НастройкаЗапускаСценарияКод));
		ЗаписьJSON.ЗаписатьИмяСвойства("НастройкаЗапускаПроцесса");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.НастройкаЗапускаПроцессаКод));
		ЗаписьJSON.ЗаписатьИмяСвойства("ИдентификаторБазы");
		ЗаписьJSON.ЗаписатьЗначение(XMLСтрока(ВыборкаТестов.ИдентификаторБазы));
		ЗаписьJSON.ЗаписатьКонецОбъекта();
		
		JsonТесты = ЗаписьJSON.Закрыть();    
		КлючПараметра = ИмяПараметра + СокрЛП(ВыборкаТестов.Код) 
						+ "_" + СтрЗаменить(ВыборкаТестов.ИдентификаторПроекта, "-", "_");
		Параметры.Вставить(КлючПараметра, JsonТесты);
			
	КонецЦикла;
	Если ЕстьТесты Тогда 
		Параметры.Вставить("TEST_FILTER", "TRUE");
	КонецЕсли;
	
	ЗаписьJSON = Неопределено;
КонецПроцедуры

#КонецОбласти

#КонецЕсли
